Repository: yesworld/plugin-wp-optimize-image
Catalog: images-optimize-and-upload-cf7/languages/images-optimize-and-upload-cf7-*.po
Languages: ru_ru

source: Damir Akhmedshin and Rustam Sibagatov
ru_ru: Дамир Ахмедшин, Рустам Сибагатов

source: A simple plugin that automatically optimizes, resizes & uploads images in Contact Form 7 plugin forms on the client side. You get nice and compressed images.
ru_ru: Простой плагин, который автоматически оптимизирует, изменяет размер на стороне клиента и загружает картинки в плагине Contact Form 7. Вы получаете лёгкие и оптимизированные картинки.

source: There was an error uploading the file. Please contact the website administrator.
ru_ru: При загрузке файла возникла ошибка. Пожалуйста, обратитесь к администратору сайта.

source: You are not allowed to upload files of this type.
ru_ru: Вы не можете загрузить файлы данного формата.

source: Generate a form-tag for an Image Optimize & Upload field. For more details, see %s.
ru_ru: Генерируйте тег формы для поля загрузки оптимизированных изображений. Для более подробной информации см. %s.

source: Images Optimize & Upload on GitHub
ru_ru: Images Optimize & Upload на GitHub

source: Images Optimize & Upload - Settings
ru_ru: Images Optimize & Upload - Настройки

source: Maximum Files
ru_ru: Максимум файлов

source: Images Preview Template
ru_ru: Шаблон превьюшек

source: The template, which is used to generate images previews on the front end.
ru_ru: Шаблон, который используется для генерирования превьюшек на фронт-енде.

source: Default:
ru_ru: По умолчанию:

source: The maximum number of images that users can upload in one form.
ru_ru: Максимальное количество файлов, который пользователи могут загрузить в одной форме.

source: Output Target File Size
ru_ru: Размер итогового файла

source: The output file size of the image in MB. If the image size is greater than the output target file size after a compression, the image is compressed with a lower quality. This happens again and again until the next compression would make the size &lt;= the output target file size or the quality would be less than the minimum quality. Default value: 0.2 (200 KB).
ru_ru: Размер итоговой картинки в МБ. Если после сжатия размер картинки больше, чем размер итогового файла, картинка будет сжиматься в качестве. Это будет происходить столько раз и до тех пор, пока сжатие файла не достигнет значения &lt;= размера итогового файла, либо не достигнет минимального качества. Значение по умолчанию: 0.2 (200 КБ).

source: Quality
ru_ru: Качество

source: The initial quality to compress the image at. Default value: 0.75 (75% compression).
ru_ru: Качество, в которое будет сжиматься картинки. Значение по умолчанию: 0.75 (75% сжатия).

source: Minimum Quality
ru_ru: Минимальной качество

source: The minimum quality allowed for an image compression. This is only relevant if the initial compression does not make the image size &lt;= the Desired Output File Size.
ru_ru: Минимальной качество сжатия картинки. Этот параметр имеет значение только в случае, если качество картинки при сжатии не позволяет достигнуть значения &lt;= размера итогового файла.

source: Quality Step Size
ru_ru: Размер шага качества

source: The amount to try reducing the quality by in each iteration, if the image size is still &gt; the Desired Output File Size.
ru_ru: Размер шага качества картинки при сжатии, в случае если размер картинки всё ещё &gt; размер итогового файла.

source: Maximum Width
ru_ru: Максимальная ширина

source: The maximum width of the output image. The value is in pixels. Please, use only numbers.
ru_ru: Максимальная ширина итоговой картинки. Значение в пикселях. Пожалуйста, используйте только цифры.

source: Maximum Height
ru_ru: Максимальная высота

source: The maximum height of the output image. The value is in pixels. Please, use only numbers.
ru_ru: Максимальная высота итоговой картинки. Значение в пикселях. Пожалуйста, используйте только цифры.

source: Resize
ru_ru: Изменять размер

source: Yes
ru_ru: Да

source: No
ru_ru: Нет

source: Whether the image should be resized to within the bounds set by Maximum Width and Maximum Height (maintains the aspect ratio).
ru_ru: Нужно ли изменять размер картинки в соответствии с размерами, указанными в максимальной ширине и высоте (соотношение сторон сохраняется).

source: Show Errors in Browser Console
ru_ru: Показывать ошибки в консоли браузера

source: Whether to throw an Error if the Desired Output File Size is not reached.
ru_ru: Показывать ли ошибки в консоли браузера, если размер итогового файла не был достигнут.

source: Formats of uploaded files
ru_ru: Форматы загружаемых файлов

source: You can allow other files to be uploaded. List their formats via | (For example: docx|pptx|xlsx|mp3|wav, etc.). Attention! The plugin optimizes only images.
ru_ru: Вы можете разрешить загрузку других файлов. Перечислите их форматы через | (Например: docx|pptx|xlsx|mp3|wav и т.д.). Внимание! Плагин оптимизирует только изображения.

source: Limit on the total size of files sent
ru_ru: Ограничение на суммарный размер отправляемых файлов

source: The maximum size of files sent via the form. Default: 15 MB. Do not use a large size, as there may be restrictions on the size of uploaded files set in the settings of WP, PHP and the mail service.
ru_ru: Максимальный размер файлов, отправляемых через форму. По умолчанию: 15 МБ. Не используйте большой размер, так как могут быть ограничения на размер загружаемых файлов, установленные в настройках WP, PHP и почтового сервиса.

source: Remove Temp Files from Server
ru_ru: Удалить временные файлы с сервера

source: Whether the temporary files should be removed or saved on the server. If you want to keep the files on the server, use Contact Form 7 Database Addon – CFDB7 to access them.
ru_ru: Следует ли удалять временные файлы или сохранять их на сервере. Если вы хотите сохранить файлы на сервере, используйте Contact Form 7 Database Addon – CFDB7 для доступа к ним.

source: Drag & Drop Area Template
ru_ru: Шаблон поля drag & drop

source: The template which is used to generate drag and drop area on the front end. Be careful when editing this field.
ru_ru: Шаблон, который используется для генерации поля drag & drop на фронт-енде. Редактируйте это поле с осторожностью.

source: The template which is used to generate images previews on the front end. This field can not be empty.
ru_ru: Шаблон, который используется на генерации превьюшек загруженных картинок на фронт-енде. Это поле не может быть пустым.

source: Uploaded image file name.
ru_ru: Имя загруженного файла.

source: Original image size. In MB.
ru_ru: Размер оригинального файла. В МБ.

source: Optimized image size. In MB.
ru_ru: Размер оптимизированного файла. В МБ.

source: Original image width.
ru_ru: Ширина оригинального файла.

source: Original image height.
ru_ru: Высота оригинального файла.

source: Optimized image width.
ru_ru: Ширина оптимизированного файла.

source: Optimized image height.
ru_ru: Высота оптимизированного файла.

source: Delete tooltip text.
ru_ru: Текст подсказки Удалить.

source: Original Size text.
ru_ru: Текст Оригинал.

source: Compressed text.
ru_ru: Текст Сжатый файл.

source: Limitations
ru_ru: Ограничения

source: There are several limitations for this plugin:
ru_ru: Этот плагин имеет несколько ограничений:

source: * This plugin optimizes images of the following file formats: PNG, JPG, JPEG, GIF, BMP.
ru_ru: * Этот плагин оптимизирует изображения следующих форматов файлов: PNG, JPG, JPEG, GIF, BMP.

source: * When working with animated GIF, the compressed image will no longer animate.
ru_ru: * При загрузке анимированных картинок GIF, анимация перестанет работать.

source: * When working with PNG with transparent background, the compressed image will lose transparency and result in black background.
ru_ru: * При загрузке картинок PNG с прозрачным фоном, сжатый файл будет иметь чёрный фон.

source: Maximum %d file is allowed.
ru_ru: Можно загрузить максимум %d файл.

source: Drag & Drop Images Here
ru_ru: Перенесите файлы сюда

source: or
ru_ru: или

source: Browse Files
ru_ru: Выбрать файл

source: Original size
ru_ru: Оригинал

source: Compressed
ru_ru: Сжатый файл

source: Delete
ru_ru: Удалить

source: The total files size should not exceed
ru_ru: Общий размер файлов не должен превышать

source: Uploading files...
ru_ru: Загрузка файлов...

source: Wrong file format
ru_ru: Недопустимый формат файла
